chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/processor/usb_p32mx530f128l.h
PLIB_INLINE SFR_DATA _USB_AUTO_SUSPEND_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CNFG1_UASUSPND_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP0_LOW_SPEED_CONNECT_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_LSPD_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP0_NO_RETRY_NAKS_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_RETRYDIS_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP0_CONTROL_OFF_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_EPCONDIS_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP0_RCV_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_EPRXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP0_XMIT_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_EPTXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP0_XMIT_ON_EN_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_EPTXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP0_STALL_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_EPSTALL_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP0_HANDSHAKE_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_EPHSHK_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP1_CONTROL_OFF_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP1_EPCONDIS_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP1_RCV_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP1_EPRXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP1_XMIT_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP1_EPTXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP1_STALL_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP1_EPSTALL_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP1_HANDSHAKE_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP1_EPHSHK_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP2_CONTROL_OFF_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP2_EPCONDIS_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP2_RCV_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP2_EPRXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP2_XMIT_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP2_EPTXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP2_STALL_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP2_EPSTALL_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP2_HANDSHAKE_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP2_EPHSHK_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP3_CONTROL_OFF_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP3_EPCONDIS_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP3_RCV_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP3_EPRXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP3_XMIT_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP3_EPTXEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP3_STALL_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP3_EPSTALL_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP3_HANDSHAKE_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP3_EPHSHK_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

